/* the musical note A */
"A" = "A";

/* live view 9 label */
"A black Skoog Circle appears in the center of the Live View.   This will change color, size and transparency depending on where and how hard you press the Skoog, and on what functions you have used in your code." = "A black Skoog Circle appears in the center of the Live View.   This will change color, size and transparency depending on where and how hard you press the Skoog, and on what functions you have used in your code.";

/* live view label part 1 */
"A black skoog circle appears in the center of the Live View.  This will change color depending on what side of the Skoog you press, and a matching colored ripple or pulse will animate depending on your code." = "A black skoog circle appears in the center of the Live View.  This will change color depending on what side of the Skoog you press, and a matching colored ripple or pulse will animate depending on your code.";

/* live view 10 label */
"A black Skoog Circle appears in the center of the Live View.  This will change color depending on what side of the Skoog you press. A matching colored ripple or pulse will animate depending on your code." = "A black Skoog Circle appears in the center of the Live View.  This will change color depending on what side of the Skoog you press. A matching colored ripple or pulse will animate depending on your code.";

/* live view 11 label */
"A black Skoog Circle appears in the center of the Live View. This will change color depending on what side of the Skoog you press and a matching colored ripple or pulse will animate depending on your code." = "A black Skoog Circle appears in the center of the Live View. This will change color depending on what side of the Skoog you press and a matching colored ripple or pulse will animate depending on your code.";

/* live view 4 label */
"A black Skoog Circle appears in the center of the Live View. This will change color depending on what side of the Skoog you press, and a matching colored ripple will expand and fade across the screen." = "A black Skoog Circle appears in the center of the Live View. This will change color depending on what side of the Skoog you press, and a matching colored ripple will expand and fade across the screen.";

/* live view 7 label */
"A black Skoog Circle appears in the center of the Live View. This will change color depending on what side of the Skoog you press, and a matching colored ripple will expand and fade across the screen. A label will display the MIDI number, note name and octave number, depending on the side of the Skoog device being pressed." = "A black Skoog Circle appears in the center of the Live View. This will change color depending on what side of the Skoog you press, and a matching colored ripple will expand and fade across the screen. A label will display the MIDI number, note name and octave number, depending on the side of the Skoog device being pressed.";

/* live view 5 label
   live view 6 label */
"A black Skoog Circle appears in the center of the Live View. This will change color depending on what side of the Skoog you press, and a matching colored ripple will expand and fade across the screen. Labels will display a count of the number of presses and the currently selected sound style." = "A black Skoog Circle appears in the center of the Live View. This will change color depending on what side of the Skoog you press, and a matching colored ripple will expand and fade across the screen. Labels will display a count of the number of presses and the currently selected sound style.";

/* live view 8 label */
"A black Skoog Circle appears in the center of the Live View. This will change color depending on what side of the Skoog you press, and a matching colored ripple will expand and fade across the screen. Labels will display details of the note being played, and if your code detected a hard press or a soft press." = "A black Skoog Circle appears in the center of the Live View. This will change color depending on what side of the Skoog you press, and a matching colored ripple will expand and fade across the screen. Labels will display details of the note being played, and if your code detected a hard press or a soft press.";

/* live view 2 label */
"A black Skoog Circle appears in the center of the Live View. This will change color depending on what side of the Skoog you press." = "A black Skoog Circle appears in the center of the Live View. This will change color depending on what side of the Skoog you press.";

/* live view 3 label */
"A graph showing squeeze data from your Skoog is displayed.  As you squeeze the Skoog, the color of the data changes. The squeeze data moves higher or lower on the screen depending on how hard you press the Skoog.  There is a horizontal line across the graph, indicating a threshold level that can be adjusted in your code.  A sound will be triggered when the squeeze data goes higher than the threshold." = "A graph showing squeeze data from your Skoog is displayed.  As you squeeze the Skoog, the color of the data changes. The squeeze data moves higher or lower on the screen depending on how hard you press the Skoog.  There is a horizontal line across the graph, indicating a threshold level that can be adjusted in your code.  A sound will be triggered when the squeeze data goes higher than the threshold.";

/* live view 13 label */
"A white Skoog Circle appears in the center of the Live View.  This will change color depending on what side of the Skoog you press and a matching colored ripple or pulse will animate depending on your code. Several small circular Pings will be arranged around the outside of the Skoog Circle depending on your code. When a colored ripple or pulse meets a Ping, the Ping will glow gently and make a sound if it has the same color.  A white Ping will make a sound when ripples or pulses of any color meet it." = "A white Skoog Circle appears in the center of the Live View.  This will change color depending on what side of the Skoog you press and a matching colored ripple or pulse will animate depending on your code. Several small circular Pings will be arranged around the outside of the Skoog Circle depending on your code. When a colored ripple or pulse meets a Ping, the Ping will glow gently and make a sound if it has the same color.  A white Ping will make a sound when ripples or pulses of any color meet it.";

/* AX activate announcement name */
"activate announcements" = "activate announcements";

/* activated AX string */
"activated" = "activated";

/* Detailed announcements AX string */
"announcements " = "announcements ";

/* the musical note B */
"B" = "B";

/* the color blue */
"blue" = "blue";

/* the musical note B♭ */
"B♭" = "B♭";

/* the musical note C */
"C" = "C";

/* Calibration progress label */
"Calibrating" = "Calibrating";

/* Calibration AX progress label */
"Calibrating the Skoog." = "Calibrating the Skoog.";

/* Calibration complete AX text */
"Calibration complete" = "Calibration complete";

/* changing alpha string */
"changing alpha" = "changing alpha";

/* changing size string */
"changing size" = "changing size";

/* connect Skoog AX hint text */
"Click here to connect your skoog" = "Click here to connect your skoog";

/* connect Skoog AX hint text */
"Click here to disconnect your skoog" = "Click here to disconnect your skoog";

/* AX color reminder name */
"color reminder" = "color reminder";

/* connect Skoog text */
"Connect Skoog" = "Connect Skoog";

/* bluetooth midi label text connecting */
"Connecting skoog" = "Connecting skoog";

/* bluetooth midi label text connecting */
"Connecting Skoog" = "Connecting Skoog";

/* count label */
"Count" = "Count";

/* the musical note C♯ */
"C♯" = "C♯";

/* the musical note D */
"D" = "D";

/* AX deactivata announcement name */
"deactivate announcements" = "deactivate announcements";

/* deactivated AX string */
"deactivated" = "deactivated";

/* hard/soft note hint string 2 */
"Did you know that 1 [octave](glossary://octave) = 12 [MIDI numbers](glossary://midiNumber)?" = "Did you know that 1 [octave](glossary://octave) = 12 [MIDI numbers](glossary://midiNumber)?";

/* the musical note E */
"E" = "E";

/* the musical note E♭ */
"E♭" = "E♭";

/* the musical note F */
"F" = "F";

/* Graph page hint 1 string */
"For the best musical response, set the threshold as low as possible so that the Skoog responds as quickly as possible. Don't set it too low, though, or the Skoog might play with accidental touches." = "For the best musical response, set the threshold as low as possible so that the Skoog responds as quickly as possible. Don't set it too low, though, or the Skoog might play with accidental touches.";

/* the musical note F♯ */
"F♯" = "F♯";

/* the musical note G */
"G" = "G";

/* Great job string */
"Great job!" = "Great job!";

/* the color green */
"green" = "green";

/* the musical note G♯ */
"G♯" = "G♯";

/* Hard label */
"Hard" = "Hard";

/* hard/soft note hint string 1 */
"Have you set the threshold to a value between 0.0 and 1.0?" = "Have you set the threshold to a value between 0.0 and 1.0?";

/* Loading image AX label */
"Loading" = "Loading";

/* MIDI should not be localized */
"MIDI" = "MIDI";

/* Calibration AX failure label */
"no skoogs found" = "no skoogs found";

/* on top string */
"On top of the Skoog Circle" = "On top of the Skoog Circle";

/* the color orange */
"orange" = "orange";

/* AX orientation reminder name */
"Orientation reminder" = "Orientation reminder";

/* ping custom action description */
"Ping description" = "Ping description";

/* Press label */
"Press " = "Press ";

/* pulse string */
"pulse" = "pulse";

/* the color red */
"red" = "red";

/* ripple string */
"ripple" = "ripple";

/* AX action name */
"Scene description" = "Scene description";

/* searching for Skoog text */
"Searching for Skoog" = "Searching for Skoog";

/* bluetooth midi label text */
"Select Skoog" = "Select Skoog";

/* Skoog text */
"Skoog" = "Skoog";

/* Skoog circle AX string */
"Skoog Circle" = "Skoog Circle";

/* connected image AX label */
"skoog connected" = "skoog connected";

/* Calibration AX success label */
"skoog connected successfully" = "skoog connected successfully";

/* Skoog graph AX string */
"Skoog Graph" = "Skoog Graph";

/* AX orientation name */
"Skoog orientation" = "Skoog orientation";

/* Soft label */
"Soft" = "Soft";

/* Squeeze label */
"Squeeze" = "Squeeze";

/* AX orientation reminder prose */
"the layout of the sides is as follows: red facing towards you, blue on the left, yellow facing away from you, green on the right, and orange on top." = "the layout of the sides is as follows: red facing towards you, blue on the left, yellow facing away from you, green on the right, and orange on top.";

/* AX orientation prose */
"The Skoog has 5 domed playable sides with a different note on each. To help distinguish the notes, each side has a colored ring, red, blue, yellow, green, and orange. There is a tactile orientation marker on the underside of the Skoog, 9 raised dots in a grid pattern, indicating the position of the yellow side. Use this to orient your Skoog with the yellow side facing away from you. In this orientation, the layout of the sides is as follows: red facing towards you, blue on the left, yellow facing away from you, green on the right, and orange on top." = "The Skoog has 5 domed playable sides with a different note on each. To help distinguish the notes, each side has a colored ring, red, blue, yellow, green, and orange. There is a tactile orientation marker on the underside of the Skoog, 9 raised dots in a grid pattern, indicating the position of the yellow side. Use this to orient your Skoog with the yellow side facing away from you. In this orientation, the layout of the sides is as follows: red facing towards you, blue on the left, yellow facing away from you, green on the right, and orange on top.";

/* dynamic ripples hint string 1 */
"Try adding `ripple(color: side.color, size: strength)` to the `if`, and `ripple(color: side.color, size: strength)` to the `else`" = "Try adding `ripple(color: side.color, size: strength)` to the `if`, and `ripple(color: side.color, size: strength)` to the `else`";

/* handling skoog hint 1 string */
"Try an 'if-else-statement' using the 'side.name' to test for .red, .blue, .yellow, .green and .orange." = "Try an 'if-else-statement' using the 'side.name' to test for .red, .blue, .yellow, .green and .orange.";

/* Graph page hint 2 string */
"Try setting all threshold values less than 0.2 for red, blue, yellow, green, orange." = "Try setting all threshold values less than 0.2 for red, blue, yellow, green, orange.";

/* meet the band hint string 1 */
"Try using an else-if statement to check for 3x the number of presses plus 1. " = "Try using an else-if statement to check for 3x the number of presses plus 1. ";

/* live view label part 3 */
"When a colored ripple or pulse meets a ping, the ping will glow gently and make a sound if it has the same color.  A white ping will make a sound when ripples or pulses of any color meet it." = "When a colored ripple or pulse meets a ping, the ping will glow gently and make a sound if it has the same color.  A white ping will make a sound when ripples or pulses of any color meet it.";

/* in the loop hint string 2 */
"When count gets to the end, try setting `count = 0`." = "When count gets to the end, try setting `count = 0`.";

/* in the loop hint string 1 */
"Write an `else if{}` statement that checks when the number of presses has played the last sound style 5 times." = "Write an `else if{}` statement that checks when the number of presses has played the last sound style 5 times.";

/* the color yellow */
"yellow" = "yellow";

